andrewleech/micropython/ports/stm32/eth.c
            // Get RX buffer containing new frame
            #if defined(STM32H5) || defined(STM32H7) || defined(STM32N6)
            size_t len = (rx_descr_l->rdes3 & RX_DESCR_3_PL_Msk);
            #else
            size_t len = (rx_descr->rdes0 & RX_DESCR_0_FL_Msk) >> RX_DESCR_0_FL_Pos;
            #endif
            len -= 4; // discard CRC at end
            #if defined(STM32H5) || defined(STM32H7) || defined(STM32N6)
            uint8_t *buf = &eth_dma.rx_buf[eth_dma.rx_descr_idx * RX_BUF_SIZE];
            #else
            uint8_t *buf = (uint8_t *)rx_descr->rdes2;
            #endif

            // Process frame
            eth_process_frame(&eth_instance, len, buf);
            eth_dma_rx_free();
        }
    }
}

/*******************************************************************************/
// ETH-LwIP bindings

#define TRACE_ASYNC_EV (0x0001)
#define TRACE_ETH_TX (0x0002)
#define TRACE_ETH_RX (0x0004)
#define TRACE_ETH_FULL (0x0008)

static void eth_trace(eth_t *self, size_t len, const void *data, unsigned int flags) {
    if (((flags & NETUTILS_TRACE_IS_TX) && (self->trace_flags & TRACE_ETH_TX))
        || (!(flags & NETUTILS_TRACE_IS_TX) && (self->trace_flags & TRACE_ETH_RX))) {
        const uint8_t *buf;
        if (len == (size_t)-1) {
            // data is a pbuf
            const struct pbuf *pbuf = data;
            buf = pbuf->payload;
            len = pbuf->len; // restricted to print only the first chunk of the pbuf
        } else {
            // data is actual data buffer
            buf = data;
        }
        if (self->trace_flags & TRACE_ETH_FULL) {
            flags |= NETUTILS_TRACE_PAYLOAD;
        }
        netutils_ethernet_trace(MP_PYTHON_PRINTER, len, buf, flags);
    }
}

static err_t eth_netif_output(struct netif *netif, struct pbuf *p) {
    // This function should always be called from a context where PendSV-level IRQs are disabled

    LINK_STATS_INC(link.xmit);
    eth_trace(netif->state, (size_t)-1, p, NETUTILS_TRACE_IS_TX | NETUTILS_TRACE_NEWLINE);

    uint8_t *buf;
    int ret = eth_tx_buf_get(p->tot_len, &buf);
    if (ret == 0) {
        pbuf_copy_partial(p, buf, p->tot_len, 0);
        ret = eth_tx_buf_send();
    }

    return ret ? ERR_BUF : ERR_OK;
}

static err_t eth_netif_init(struct netif *netif) {
    netif->linkoutput = eth_netif_output;
    netif->output = etharp_output;
    netif->mtu = 1500;
    netif->flags = NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP | NETIF_FLAG_ETHERNET | NETIF_FLAG_IGMP;
    // Checksums only need to be checked on incoming frames, not computed on outgoing frames
    NETIF_SET_CHECKSUM_CTRL(netif,
        NETIF_CHECKSUM_CHECK_IP
        | NETIF_CHECKSUM_CHECK_UDP
        | NETIF_CHECKSUM_CHECK_TCP
        | NETIF_CHECKSUM_CHECK_ICMP
        | NETIF_CHECKSUM_CHECK_ICMP6);
    return ERR_OK;
}

static void eth_lwip_init(eth_t *self) {
    MICROPY_PY_LWIP_ENTER
    // Initialize netif structure
    struct netif *n = &self->netif;
    n->name[0] = 'e';
    n->name[1] = '0';
    n->state = self;

    // Set default IP configuration (0.0.0.0 = use DHCP)
    ip_addr_t ipconfig[4];
    IP_ADDR4(&ipconfig[0], 0, 0, 0, 0);        // IP: 0.0.0.0 (DHCP)
    IP_ADDR4(&ipconfig[1], 255, 255, 255, 0);  // Netmask
    IP_ADDR4(&ipconfig[2], 192, 168, 0, 1);    // Gateway
    IP_ADDR4(&ipconfig[3], 8, 8, 8, 8);        // DNS

    netif_add(n, ip_2_ip4(&ipconfig[0]), ip_2_ip4(&ipconfig[1]), ip_2_ip4(&ipconfig[2]), self, eth_netif_init, ethernet_input);
    netif_set_hostname(n, mod_network_hostname_data);

    ip_addr_t dns_addr;
    IP_ADDR4(&dns_addr, 8, 8, 8, 8);
    dns_setserver(0, &dns_addr);

    // Initialize DHCP structure
    dhcp_set_struct(n, &self->dhcp_struct);

    #if LWIP_IPV6
    netif_create_ip6_linklocal_address(n, 1);
    #endif
    MICROPY_PY_LWIP_EXIT
}

// Restart DHCP if no static IP is configured
// Used when link comes up, MAC is reconfigured, or interface starts
static void eth_dhcp_restart_if_needed(struct netif *netif) {
    if (netif_is_up(netif) && ip4_addr_isany_val(*netif_ip4_addr(netif))) {
        if (netif_dhcp_data(netif)) {
            dhcp_stop(netif);
        }
        dhcp_start(netif);
    }
}

void eth_phy_link_status_poll() {
    eth_t *self = &eth_instance;
    if (!self->enabled) {
        return;
    }
    // Poll PHY link status and handle state changes
    // PHY_BSR link status bit is latched-low (IEEE 802.3): requires two reads to get current state
    uint16_t bsr = eth_phy_read(self->phy_addr, PHY_BSR);  // First read clears latch
    bsr = eth_phy_read(self->phy_addr, PHY_BSR);  // Second read gets current state
    bool current_link_status = (bsr & PHY_BSR_LINK_STATUS) != 0;

    // Check if link status changed
    if (current_link_status != self->last_link_status) {
        self->last_link_status = current_link_status;

        // Update LWIP netif link status to reflect physical cable connection
        struct netif *netif = &self->netif;
        MICROPY_PY_LWIP_ENTER
        if (current_link_status) {
            // Cable is physically connected
            netif_set_link_up(netif);

            // Mark MAC speed as needing configuration (will be done after autoneg completes)
            self->mac_speed_configured = false;
            self->autoneg_start_ms = mp_hal_ticks_ms();

            // Start or restart DHCP if no static IP configured
            eth_dhcp_restart_if_needed(netif);
        } else {
            // Cable is physically disconnected
            netif_set_link_down(netif);
            self->mac_speed_configured = false;

            // Stop DHCP on cable unplug
            struct dhcp *dhcp = netif_dhcp_data(netif);
            if (dhcp != NULL) {
                dhcp_stop(netif);
            }
        }
        MICROPY_PY_LWIP_EXIT
    }

    // If link is up but MAC speed/duplex not yet configured, check if autoneg is complete
    if (current_link_status && !self->mac_speed_configured) {
        // Re-verify link is still up before proceeding (link could have changed since first check)
        if (!self->last_link_status) {
            return;  // Link went down since first check, abort MAC reconfiguration
        }

