andrewleech/micropython/ports/stm32/eth.c
        // Check if autonegotiation has completed
        bsr = eth_phy_read(self->phy_addr, PHY_BSR);

        // Check for autoneg timeout - if exceeded, use default speed
        bool autoneg_timeout = (mp_hal_ticks_ms() - self->autoneg_start_ms) > PHY_AUTONEG_TIMEOUT_MS;

        if ((bsr & PHY_BSR_AUTONEG_DONE) || autoneg_timeout) {
            // Autonegotiation complete or timed out - read negotiated speed/duplex
            uint16_t phy_speed = self->phy_get_link_status(self->phy_addr);

            // If autoneg timed out and speed couldn't be read, use safe default (10Mbps Half)
            if (autoneg_timeout && phy_speed == 0) {
                phy_speed = PHY_SPEED_10HALF;
                mp_printf(&mp_plat_print, "ETH: Autonegotiation timeout, using 10Mbps Half-Duplex\n");
            }

            // Set flag to prevent IRQ handler from processing packets during reconfiguration
            self->mac_reconfig_in_progress = true;

            // Update MAC to match PHY negotiated speed/duplex
            uint32_t maccr = ETH->MACCR;

            // Stop TX/RX temporarily to allow safe reconfiguration
            maccr &= ~(ETH_MACCR_TE | ETH_MACCR_RE);
            ETH->MACCR = maccr;

            // Poll for TX/RX to stop (wait for in-flight operations to complete)
            // Check if DMA has released all RX descriptors
            uint32_t poll_start = mp_hal_ticks_ms();
            bool rx_stopped = false;
            while (!rx_stopped && (mp_hal_ticks_ms() - poll_start < 100)) {
                rx_stopped = true;
                for (size_t i = 0; i < RX_BUF_NUM; ++i) {
                    #if defined(STM32H5) || defined(STM32H7) || defined(STM32N6)
                    if (eth_dma.rx_descr[i].rdes3 & (1 << RX_DESCR_3_OWN_Pos)) {
                        rx_stopped = false;
                        break;
                    }
                    #else
                    if (eth_dma.rx_descr[i].rdes0 & (1 << RX_DESCR_0_OWN_Pos)) {
                        rx_stopped = false;
                        break;
                    }
                    #endif
                }
                if (!rx_stopped) {
                    mp_hal_delay_ms(1);
                }
            }

            // Clear speed/duplex bits and set according to PHY
            #if defined(STM32N6)
            // N6 uses PS bit to distinguish 10Mbit (PS=1) from 1000Mbit (PS=0) when FES=0
            maccr &= ~(ETH_MACCR_FES | ETH_MACCR_DM | ETH_MACCR_PS);

            if (phy_speed == PHY_SPEED_1000FULL) {
                // 1000Mbit Full: FES=0, PS=0, DM=1
                maccr |= ETH_MACCR_DM;
            } else if (phy_speed == PHY_SPEED_1000HALF) {
                // 1000Mbit Half: FES=0, PS=0, DM=0
                // All bits clear (default)
            } else if (phy_speed == PHY_SPEED_100FULL) {
                // 100Mbit Full: FES=1, PS=1, DM=1
                maccr |= ETH_MACCR_FES | ETH_MACCR_PS | ETH_MACCR_DM;
            } else if (phy_speed == PHY_SPEED_100HALF) {
                // 100Mbit Half: FES=1, PS=1, DM=0
                maccr |= ETH_MACCR_FES | ETH_MACCR_PS;
            } else if (phy_speed == PHY_SPEED_10FULL) {
                // 10Mbit Full: FES=0, PS=1, DM=1
                maccr |= ETH_MACCR_PS | ETH_MACCR_DM;
            } else {
                // 10Mbit Half: FES=0, PS=1, DM=0
                maccr |= ETH_MACCR_PS;
            }
            #else
            maccr &= ~(ETH_MACCR_FES | ETH_MACCR_DM);

            if (phy_speed == PHY_SPEED_100FULL) {
                maccr |= ETH_MACCR_FES | ETH_MACCR_DM;
            } else if (phy_speed == PHY_SPEED_100HALF) {
                maccr |= ETH_MACCR_FES;
            } else if (phy_speed == PHY_SPEED_10FULL) {
                maccr |= ETH_MACCR_DM;
            }
            // else: 10HALF = both bits clear
            #endif

            ETH->MACCR = maccr;

            // Restart TX/RX
            ETH->MACCR |= ETH_MACCR_TE | ETH_MACCR_RE;

            // Clear flag to allow IRQ handler to resume processing
            self->mac_reconfig_in_progress = false;

            // Mark as configured
            self->mac_speed_configured = true;

            // Restart DHCP if no static IP configured (since MAC was reconfigured)
            struct netif *netif = &self->netif;
            MICROPY_PY_LWIP_ENTER
            eth_dhcp_restart_if_needed(netif);
            MICROPY_PY_LWIP_EXIT
        }
    }
}

static void eth_process_frame(eth_t *self, size_t len, const uint8_t *buf) {
    eth_trace(self, len, buf, NETUTILS_TRACE_NEWLINE);

    struct netif *netif = &self->netif;
    if (netif->flags & NETIF_FLAG_LINK_UP) {
        struct pbuf *p = pbuf_alloc(PBUF_RAW, len, PBUF_POOL);
        if (p != NULL) {
            pbuf_take(p, buf, len);
            if (netif->input(p, netif) != ERR_OK) {
                pbuf_free(p);
            }
        }
    }
}

struct netif *eth_netif(eth_t *self) {
    return &self->netif;
}

int eth_link_status(eth_t *self) {
    // Do a quick poll to ensure link status is current
    eth_phy_link_status_poll();

    struct netif *netif = &self->netif;
    if ((netif->flags & (NETIF_FLAG_UP | NETIF_FLAG_LINK_UP))
        == (NETIF_FLAG_UP | NETIF_FLAG_LINK_UP)) {
        if (!ip4_addr_isany_val(*netif_ip4_addr(netif))) {
            return 3; // link up with IP
        } else {
            return 2; // link up, no IP
        }
    } else {
        // Check physical link status - use direct PHY read if not enabled yet
        bool physical_link_up;
        if (self->enabled) {
            physical_link_up = self->last_link_status;
        } else {
            // Direct PHY read when interface not enabled
            // PHY_BSR link status bit is latched-low: requires two reads
            uint16_t bsr = eth_phy_read(self->phy_addr, PHY_BSR);
            bsr = eth_phy_read(self->phy_addr, PHY_BSR);
            physical_link_up = (bsr & PHY_BSR_LINK_STATUS) != 0;
        }

        if (physical_link_up) {
            return 1; // physical link up but interface down
        } else {
            return 0; // link down
        }
    }
}

bool eth_is_enabled(eth_t *self) {
    return self->enabled;
}

int eth_start(eth_t *self) {
    // Make sure Eth is Not in low power mode.
    eth_low_power_mode(self, false);

    int ret = eth_mac_init(self);
    if (ret < 0) {
        return ret;
    }

    // Initialize PHY (reset and configure)
    mp_printf(&mp_plat_print, "ETH: Calling PHY init\n");
    ret = eth_phy_init(self);
    if (ret < 0) {
        mp_printf(&mp_plat_print, "ETH: PHY init failed: %d\n", ret);
        eth_mac_deinit(self);
        return ret;
    }
    mp_printf(&mp_plat_print, "ETH: PHY init success\n");

    MICROPY_PY_LWIP_ENTER
    struct netif *n = &self->netif;

    // Enable the interface in LWIP
    netif_set_default(n);
    netif_set_up(n);

