andrewleech/micropython/ports/stm32/eth.c
    // Do an initial link status poll after PHY has had time to initialize
    eth_phy_link_status_poll();

    // Start DHCP if no static IP configured
    eth_dhcp_restart_if_needed(n);

    MICROPY_PY_LWIP_EXIT

    self->enabled = true;
    return 0;
}

int eth_stop(eth_t *self) {
    // Stop DHCP if running
    if (netif_dhcp_data(&self->netif)) {
        dhcp_stop(&self->netif);
    }
    netif_set_down(&self->netif);

    // Shutdown PHY
    eth_low_power_mode(self, true);

    // Clear link status tracking
    self->last_link_status = false;

    eth_mac_deinit(self);
    self->enabled = false;
    return 0;
}

void eth_low_power_mode(eth_t *self, bool enable) {
    (void)self;

    // Enable eth clock
    #if defined(STM32H7)
    __HAL_RCC_ETH1MAC_CLK_ENABLE();
    #elif defined(STM32N6)
    __HAL_RCC_ETH1_CLK_ENABLE();
    #else
    __HAL_RCC_ETH_CLK_ENABLE();
    #endif

    uint16_t bcr = eth_phy_read(self->phy_addr, PHY_BCR);
    if (enable) {
        // Enable low-power mode.
        eth_phy_write(self->phy_addr, PHY_BCR, bcr | PHY_BCR_POWER_DOWN);
        // Disable eth clock.
        #if defined(STM32H7)
        __HAL_RCC_ETH1MAC_CLK_DISABLE();
        #elif defined(STM32N6)
        __HAL_RCC_ETH1_CLK_DISABLE();
        #else
        __HAL_RCC_ETH_CLK_DISABLE();
        #endif
    } else {
        // Disable low-power mode.
        eth_phy_write(self->phy_addr, PHY_BCR, bcr & (~PHY_BCR_POWER_DOWN));
    }
}

static int eth_phy_init(eth_t *self) {
    // Reset and initialize the PHY
    mp_printf(&mp_plat_print, "ETH: PHY init addr=%d\n", (int)self->phy_addr);
    self->phy_init(self->phy_addr);
    mp_hal_delay_ms(10);

    // Wait for PHY reset to complete (but don't wait for link)
    uint32_t t0 = mp_hal_ticks_ms();
    while (eth_phy_read(self->phy_addr, PHY_BCR) & PHY_BCR_SOFT_RESET) {
        if (mp_hal_ticks_ms() - t0 > 1000) {  // 1 second timeout for reset
            mp_printf(&mp_plat_print, "ETH: PHY reset timeout\n");
            return -MP_ETIMEDOUT;
        }
        mp_hal_delay_ms(2);
    }
    mp_printf(&mp_plat_print, "ETH: PHY reset complete\n");

    // Read PHY ID to verify MDIO communication
    uint32_t phy_id1 = eth_phy_read(self->phy_addr, 0x02);
    uint32_t phy_id2 = eth_phy_read(self->phy_addr, 0x03);
    mp_printf(&mp_plat_print, "ETH: PHY ID=0x%04x%04x\n", (int)phy_id1, (int)phy_id2);

    // Enable autonegotiation for all speed/duplex modes
    // This starts the autonegotiation process in the background
    mp_printf(&mp_plat_print, "ETH: Configuring autoneg\n");

    // Configure 10/100 speeds
    eth_phy_write(self->phy_addr, PHY_ANAR,
        PHY_ANAR_SPEED_10HALF |
        PHY_ANAR_SPEED_10FULL |
        PHY_ANAR_SPEED_100HALF |
        PHY_ANAR_SPEED_100FULL |
        PHY_ANAR_IEEE802_3);

    // For gigabit PHYs, also advertise 1000Mbps capability
    eth_phy_write(self->phy_addr, PHY_1000BTCR,
        PHY_1000BTCR_1000HALF | PHY_1000BTCR_1000FULL);

    eth_phy_write(self->phy_addr, PHY_BCR, PHY_BCR_AUTONEG_EN | PHY_BCR_AUTONEG_RESTART);
    mp_printf(&mp_plat_print, "ETH: Autoneg started\n");

    // Initialize link status tracking (current state, whatever it is)
    self->last_link_status = false;
    self->mac_speed_configured = false;
    eth_phy_link_status_poll();

    return 0;
}

#endif // defined(MICROPY_HW_ETH_MDC)
